constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] 1e-06;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 0.8;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.5;


//specify your settling velocity
V0              V0 [ 0 1 -1 0 0 0 0 ] ( 0 0 -1.5e-3 );

// ************************************************************************* //
